//Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
//N = 5 -> "5, 4, 3, 2, 1"
//N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

/*

Console.Write("Введите число N: ");

int N = Convert.ToInt32(Console.ReadLine());

int GetStringOfNumbers(int start, int end)
{
    // Базовый случай - выход 
     if (start == end) return end;
  else Console.Write($"{GetStringOfNumbers(start, end + 1)}, ");
  return end;
}
Console.WriteLine($"{GetStringOfNumbers(N, 1)} "); // start = 1, end = N

*/

// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов 
// в промежутке от M до N.

/*
Console.Write("Введите число N: ");
int m = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите число M: ");
int n = Convert.ToInt32(Console.ReadLine());

SumFromMToN(m, n);

// вызов функции "сумма чисел от M до N"
void SumFromMToN(int m, int n)
{
    Console.Write(SumMN(m - 1, n));
}

// функция сумма чисел от M до N
int SumMN(int m, int n)
{
    int res = m;
    if (m == n)
        return 0;
    else
    {
        m++;
        res = m + SumMN(m, n);
        return res;
    }
}
*/

//Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n. 

Console.Write("Введите число M: ");
int m = Convert.ToInt32(Console.ReadLine());

Console.Write("Введите число N: ");
int n = Convert.ToInt32(Console.ReadLine());







// функция Аккермана
int Akkerman(int m, int n)
{
  if (m == 0) return n + 1;
  if (m > 0 && n == 0) return Akkerman(m - 1, 1);
  else return Akkerman(m - 1, Akkerman(m, n - 1));
}



Console.WriteLine($"Akkerman({m},{n}) = {Akkerman(m, n)}");